# GuidEnum Methods

---
The GuidEnum type exposes the following members.
| Name| Description
---|---|---
| Equals|  Compares two Guid-based enum object based on their concrete class and GUID value. (Overrides ObjectEquals(Object))
| GetHashCode|  Generates a hash code for this Guid-based enum object. (Overrides ObjectGetHashCode)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
GuidEnum Class
Autodesk.Revit.DB Namespace